Revit 2027 API
BuiltInFailures.FamilyFailures.CouldNotPlaceAdaptiveFamInst Property
 Could not place Adaptive Family Instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CouldNotPlaceAdaptiveFamInst { get; }
Public Shared ReadOnly Property CouldNotPlaceAdaptiveFamInst As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CouldNotPlaceAdaptiveFamInst {
	FailureDefinitionId^ get ();
}
static member CouldNotPlaceAdaptiveFamInst : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace